# 친구들과 함께 3 6 9 게임을 하던 영일이는 잦은 실수 때문에 계속해서 벌칙을 받게 되었다.
# 3 6 9 게임의 왕이 되기 위한 369 마스터 프로그램을 작성해 보자.

# ** 3 6 9 게임은?
# 여러 사람이 순서를 정한 후, 순서대로 수를 부르는 게임이다.
# 만약 3, 6, 9 가 들어간 수를 자신이 불러야 하는 상황이라면, 수를 부르는 대신 "박수(X)" 를 쳐야 한다.
# 33과 같이 3,6,9가 두 번 들어간 수 일때, "짝짝"과 같이 박수를 두 번 치는 형태도 있다. 

# 30 보다 작은 정수 1개가 입력된다.
# (1 ~ 29)

# 1 부터 그 수까지 순서대로 공백을 두고 수를 출력하는데,
# 3 또는 6 또는 9가 포함 되어있는 수인 경우, 그 수 대신 영문 대문자 X 를 출력한다.

# 입력 예시 
# 9

# 출력 예시
# 1 2 X 4 5 X 7 8 X


num = int(input())
for i in range(1, num+1):
  if i < 10 and i % 3 == 0:
    print("X", end = " ")
  elif i % 10 > 0 and (i%10) % 3 == 0:
    print("X", end = " ")
  else:
    print(i, end = " ")




# 1부터 n까지, 1부터 m까지 숫자가 적힌 서로 다른 주사위 2개를 던졌을 때,
# 나올 수 있는 모든 경우를 출력해보자.

# 서로 다른 주사위 2개의 면의 개수 n, m이 공백을 두고 입력된다.
# 단, n, m은 10이하의 자연수

# 입력 예시
# 2 3

# 출력 예시
# 1 1
# 1 2
# 1 3
# 2 1
# 2 2
# 2 3

# n, m = input().split()
# n = int(n)
# m = int(m)
# for n in range(1, n+1):
#   for m in range(1, m+1):
#     print(n, m)


# 1, 2, 3 ... 을 계속 더해 나갈 때,
# 그 합이 입력한 정수(0 ~ 1000)보다 같거나 작을 때까지만
# 계속 더하는 프로그램을 작성해보자.

# 즉, 1부터 n까지 정수를 계속 더해 나간다고 할 때,
# 어디까지 더해야 입력한 수보다 같거나 커지는 지를 알아보고자하는 문제이다.

# 정수 1개가 입력된다.
# 1, 2, 3, 4, 5 ... 를 순서대로 계속 더해 합을 만들어가다가,
# 입력된 정수와 같거나 커졌을 때, 마지막에 더한 정수를 출력한다.



# num = int(input())
# sum = 0
# for i in range(1, num+1):
#   sum += i
#   if sum >= num:
#     print(i)
#     break





# 영문 소문자 'q'가 입력될 때까지
# 입력한 문자를 계속 출력하는 프로그램을 작성해보자.

# while True:
#   str = input()
#   if str == 'q':
#     print(str)
#     break
#   else:
#     print(str)




# 정수(1 ~ 100) 1개를 입력받아 1부터 그 수까지 짝수의 합을 구해보자.

# 예시
#다음 코드는 홀 수만 더해 출력한다.
# n = int(input())
# s = 0
# for i in range(1, n+1) :
#   if i%2==1 :
#     s += i

# print(s)

# num = int(input())
# sum = 0
# for i in range(1, num+1):
#   if i % 2 == 0:
#     sum += i
# print(sum)

# while True:
#   try :
#     num = int(input('정수를 입력하세요 : '))
#     sum = 0
#     for i in range(1, num+1):
#       if i % 2 == 0:
#         sum += i
#     break
#   except ValueError:
#     print("정수가 아닙니다.")
# print(sum)



# # 3의 배수는 통과
# # 정수 1개를 입력받는다.
# # (1 ~ 100)
# # 1부터 입력한 정수보다 작거나 같을 때까지 1씩 증가시켜 출력하되
# # 3의 배수는 출력하지 않는다.

# # 입력예시: 10
# # 출력 예시: 1 2 4 5 7 8 10

# num = float(input("숫자를 입력하세요 : "))
# i = 1
# while i <= num:
#   if i%3 == 0:
#     i+=1
#   else:
#     print(i)
#     i+=1

# print("===========================")

# for i in range(1, int(num)+1):
#   if i % 3 == 0:
#     continue
#   print(i)
