# Chapter.01

# 데이터 수집 사전 지식
# - 크롤링 vs 스크랩핑 차이
# - HTML Tag
# - 크롬 개발자 도구
#   - Elemetnt Tab - CSS Selector
#   - Network Tab - Http 처리 과정


# 크롤링과 스크랩핑 차이

# 크롤링
# 크롤링은 주기적으로, 무작위로, 크롤러 봇이 돌아다니며 페이지를 방문하여 해당 사이트 안에 있는 내용을 내가 정해놓은 규칙에 맞게 또는 무작위로
# 방대한 데이터를 수집하는 것을 우선으로 하여, 일정한 시간 간격으로 데이터를 수집. 규칙적인 것을 크롤링

# 스크래핑
# 타겟이 되는 데이터가 명확함
# 예를 들어, 뉴스라면 가장 많이 본 뉴스 10개를 가져올거야, 이러면 스크래핑
# 굉장히 간단해 보이지만, 파싱. 내가 원하는 정치 섹션의 1부터 10까지 가져오기 위해서, 네이버에서 이 부분을 HTML이라는 언어로 코딩을 해 놓았는데,
# 가장 많이 클릭된, 뷰가 많은 것들을 내부 알고리즘을 통해 보여주고 있는데 이런 것들을 파악해서.
# 웹 사이트의 범위를 수집하는 것은 맞지만 범위가 작음. 
# 이것 역시 주기적으로 값을 가져올 수 있음
# 가장 많이 스크래핑이 되는게, 1위부터 10위 같이 타겟을 정해서 스크래핑을 할 수 있다고 볼 수 있음.

# 범위는 크롤링이 크지만, 데이터를 가져온다는 측면에서는 같은 크롤링과 같은 역할을 할 수도 있따.
# 크롤링은 주기적이고 대용량의 데이터를 반복적으로 수집한다는 점. 
# 용어와 상관 없이, 똑같이 사용해도 무방


# HTML tag
# 웹 디자인이나 퍼블리셔, 화면에 보이는 부분을 개발하는, 담당하는 것을 프론트엔드라고 부름
# 네이버나, 다음 사이트에 접속했을 때 보이는 것들을 개발하는 프로그래머
# 눈에 보이는 정보는 브라우저를 통해 보이는데, HTML 이라는 언어를 통해서 문서화를 해 놓은 것을 브라우저를 통해 보는 것
# 이 태그를 완벽하게 알면 데이터를 가져오기가 쉽다.
# 그렇지만 몰라도 개발자 도구를 통해 타겟 데이터의 구조를 파악해서 스크래핑해서 사용할 수 있다. 
# HTML은 태그로 구성되어 있고 태그의 규칙에 따라 작성한 코드들로 페이지를 구성함. 
# HTML 태그를 통해서 보여지는 언어를 스크래핑이나 크롤링을 하게 됨. 
# 중간에는 브라우저가 있음. 우리는 이 브라우저를 통해 가져오고 싶은 데이터, 구조, 위치를 확인할 수 있음
# 이걸 가능하게 해주는 것이 크롬 개발자도구. 

# 크롬개발자도구
# 엘리먼트 탭과 네트워크탭이 중요함
# 크롤링에서 중요한 것은 엘리먼트 탭임

# 개발자 도구 내에 엘리먼트, 콘솔, 소스, 네트워크, 퍼포먼스 등 다양한 탭들이 있음
# 이 수업을 통해 크롤링이나 스크래핑 하는 방법을 배우기 위한 수업이기 때문에, 필요한 부분만.
# 우리는 엘리먼트 탭을 확실하게 알면 됨
# 나중에 배울텐데, 네트워크 탭도 알고 있으면 좋다. 

# 예를 들어 실시간 검색어가 어느 위치에 있냐? 전화기 왼쪽에 인스펙트 잇을 선택하면 파랗게 변함.
# 그 다음에 가져다가 대면 태그 부분이 내가 선택한 부분으로 바뀐다. 
# Copy selector와 Copy Xpath를 기억하면 됨. 

# CSS Selector - list_mall_wrap > div > ul > li:nth-child(1) > ul > li:nth-child(1) > a
# Xpath Selector - //*[@id="list_mall_wrap"]/div/ul/li[1]/ul/li[1]/a

# 이걸 복사에서 파이썬 코드에서 사용하면 된다. 

#네트워크
