# section 04-1
# Requests
# Requests 사용 스크래핑(1) - Session

# 쿠키 -> 정보를 담아 놨다가 활용
# 식별되지 않은 방대한 클라이언트들을 어떻게 구분할까?
# 이런 것들을 식별하기 위해 쿠키 정보를 저장해놨다가 활용

# 쿠키는 많이 사용되기 때문에, 직접 쿠기 정보를 서버에 전송할 수 있어야 함.
# 네이버 개발자도구에서 어플리케이션탭의 쿠키를 보면 이런 쿠기 정보를 활용한다고 알 수 있음
# 딕셔너리 형태로 핸들링 할 수 있고
# 방문을 할 때 마다 쿠기 정보가 쌓이는 것을 볼 수 있고. 딜리트 키로 지울 수도 있음

import requests

# 세션 활성화
s = requests.session()
# 세션을 열었다는 것은 닫는 메소드도 존재한다는 것. 그래야 불필요한 리소스 낭비를 막을 수 있음. 

r = s.get('https://www.naver.com')

# 수신 데이터
# print(r.text)

# 수신 상태 코드
# print('Status Code : {}'.format(r.status_code))

# 확인 
# print('Ok? : {}'.format(r.ok))
# true 가 나왔다는 것은 정확하게 수신이 되었다는 의미. 
# 조건문에서 주로 활용함

# 세션 비활성화
s.close()